In [1]:
import findspark
findspark.init()
import pyspark
from pyspark.sql import SparkSession
import pandas

In [4]:
spark = SparkSession.builder \
    .appName("Lendo csv com PySpark") \
    .getOrCreate()

# Carregar o arquivo CSV em um DataFrame
# Carregar o arquivo CSV em um DataFrame
spark_df = spark.read.csv('dados/Churn.csv', sep=';',header=True)

In [5]:
spark_df.show(2)

+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
|CreditScore|Geography|Gender|Age|Tenure|Balance|NumOfProducts|HasCrCard|IsActiveMember|EstimatedSalary|Exited|
+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
|        619|   France|Female| 42|     2|      0|            1|        1|             1|       10134888|     1|
|        608|    Spain|Female| 41|     1|8380786|            1|        0|             1|       11254258|     0|
+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
only showing top 2 rows

In [6]:
type(spark_df)

pyspark.sql.dataframe.DataFrame

In [7]:
pandas_df = spark_df.toPandas()

In [8]:
pandas_df.head(2)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0,1,1,1,10134888,1
1,608,Spain,Female,41,1,8380786,1,0,1,11254258,0

In [9]:
type(pandas_df)

pandas.core.frame.DataFrame